[UI_TREE]
Machine=ハードウェア設定
POWER=電源特性
TOUCH=足踏み設定

[IPG,CO2]
IPG，CO 2＝光ファイバ、CO 2
MPULSE_FREQ＝維持パルス周波数（khz）
MPULSE_RELS=維持解放時間（us）

[IPG]
IPG=ファイバレーザ
MO_DELAY_STEPS=MO遅延（us）
MODECHG_DELAY=モード切替遅延（ms）
[YAG,DP,EP,LD]
WORK_CURRENT_TYPE=ダイアログボックスに入る電流値
WORK_CURRENT_TYPEOption=レイヤ0電流|設定値
WORK_CURRENT＝設定動作電流（A）

[ALL]
SAFE_DOOR=セキュリティゲート保護
SAFE_DOOROption=無効|一時停止|中止
MARKEND_SCAN=打標終了振動子位置
MARKEND_SCANOption=原点|左上隅|上端中心位置|右上隅|右中心位置|右下隅|下端中心位置|左下隅|左側中心位置|カスタム位置|滞在元
MARKEND_X=カスタム時X座標（mm）
MARKEND_Y＝カスタム時Y座標（mm）

[SCAN]
PREHEAT_ENABLE=振動子の予熱が必要か
PREHEAT_ENABLEOption=いいえ|はい
PREHEAT_TIME＝最小予熱時間（分）
USE_LIMIT_JUMPDELAY=ジャンプ遅延を有効にするかどうか
USE_LIMIT_JUMPDELAYOption=いいえ|はい
LIMIT_JUMPLEN＝ジャンプ距離制限（mm）
LIMIT_JUMPDELAY_MM= 当たりのジャンプ時間（us）

[BitmapPower]
BitmapPower=グレースケールビットマップマーキング
AUT_TIME=減衰時間（us）
AUT_COFF=ゲイン係数（0-1）

[Signal]
Signal=信号設定
Cycle=トリガ有効回数
MARK_CNT=1回のマーキングコマンドを何回マーキングするか
DELAY=トリガ遅延（ms）
DLY_BETWEEN_MARK=2回のビーコン間遅延（ms）
MARK_END_DELAY=マーキング完了後の遅延（ms）
MARK_END_PULSE_W＝マーキング終了信号長（ms）
B_MARK_ONCE=トリガモード
B_MARK_ONCEOption=レベルトリガ|エッジトリガ
Enable_Loop_Mdt=オフライン後のサイクルマーキング
Enable_Loop_MdtOption=有効にしない|有効にする
IOSELCOUNT=I/O選択文書信号数
ENABLE_CARDTOUCH=下位機トリガ
ENABLE_CARDTOUCHOption=有効にしない|有効にする

[UI_FACE]
ExportSysPara =エクスポートパラメータ...
ImportSysPara =インポートパラメータ...
Ok=OK
Cancel=キャンセル
Apply=適用

;---------------------------------BEGIN: EMCC\HansLaserSet.dll-----------------------------------------
[DIALOG_LASERSET]

0=レーザーハードウェアのパラメータの設定ウィザード

1=前のステップ

2=次へ

3=保存

4=キャンセル


[DIALOG_POWER]

0=第二段階の設定選択したレーザーハードウェア構成

1=現在の調整範囲(%)

2=最小電流(%):

3=最大電流(A):

4=アナログQ駆動

5=デジタルQ駆動

6=Qドライブ型

7=電力供給タイプ

8=CO2レーザー電源サイズ

9=通常の電力

10=迅速な対応電源

11=以上100W

12=以上100W

13=の維持のパルスの設定

14=周波数(KHZ)

15=放時間（米国）

16=現在のアイドル(%):

17=最大デューティサイクル

18=補正電流(%)

19=レーザーハードウェアセット

20=Mの値を設定します

21=M値:

22=調整要因:

23=通常の

24=大きすぎ

25=小さすぎ


[DIALOG_MODEL]

0=第四段階にお好みに合わせて、お好きなものをお選び制御モード

1=新しい制御、簡単な操作、ユーザーは設定する必要が遅れ,こだわりの部分にレーザーを使用します。

2=伝統的なレーザ制御モードは、ほとんどの人の利用習慣、すべてのレーザで使用できます。

3=簡易モード

4=伝統的なモード

5=レーザーマーキング制御モード

6=スクエアヘッドタイプ

7=シングルヘッドモード

8=デュアルモードヘッド


[DIALOG_LaserType]

0=レーザータイプ:

1=YAGレーザー

2=DPレーザー

3=紫外線レーザー

4=CO2レーザー

5=音Qファイバーレーザー

6=SPIレーザー

7=LDレーザー

8=YLPM(HFM-H)レーザー

9=YLP-V2レーザー

10=YLPPレーザー

11=HFM-Aレーザー

12=HFM-Pレーザー

13=HFM-Rレーザー

14=HFM-Jレーザー

15 = MOPA調整可能なパルス幅のレーザー

16 ＝ 連続ファイバレーザ

17 ＝ 超高速レーザ


[DIALOG_CONTENT]

0=第五段階祝意を表したいと思います、設定完了保存に関連するパラメータ


[LaserType_Explain]

0=YAGレーザー

1=DPレーザー

2=紫外線レーザー

3=CO2レーザー

4=音Qファイバーレーザー

5=SPIレーザー

6=LDレーザー

7=MoPaファイバーレーザー

8=YLP-V2レーザー

9=YLPPレーザー

10=HFM-Aレーザー

11=HFM-Pレーザー

12=HFM-Qレーザー

13=HFM-Jレーザー

14その他の


[Model_Explain]

0=CO2 簡易モード

1=CO2 伝統的なモード

2= 音Q 通常の電力供給+デジタルQ 伝統的なモード

3= 音Q 通常の電力供給+アナログQ 伝統的なモード

4= 音Q クイック対応電源+デジタルQ 伝統的なモード

5= 音Q クイック対応電源+アナログQ 伝統的なモード

6= 音Q 通常の電力供給+アナログQ 簡易モード

7= 音Q クイック対応電源+デジタルQ 簡易モード

8= 音Q クイック対応電源+アナログQ 簡易モード

9=IPG モード

10=SPI 簡易モード

11=SPI 伝統的なモード

12=LD モード

13=YLPM(HFM-H) 伝統的なモード

14=YLPM(HFM-H) 簡易モード

15=YLP-V2 伝統的なモード

16=YLP-V2 簡易モード

17=YLPP 伝統的なモード

18=YLPP 簡易モード

19=HFM-A 伝統的なモード

20=HFM-A 簡易モード

21=HFM-P 伝統的なモード

22=HFM-P 簡易モード

23=HFM-R 伝統的なモード

24=HFM-R 簡易モード

25=HFM-J 伝統的なモード

26=HFM-J 簡易モード


[DIALOG_ScanType]

0=第三ステップ: ガルバノメータの設定タイプ

1=手作りのガルバノ

2=その他のガルバノ

3=Tips:を選択してください機械に対応したガルバノメータの型, 手作りのガルバノメータの電源投入後は、温かいため、正常に動作し,その他のガルバノず予熱
;---------------------------------End: EMCC\HansLaserSet.dll-----------------------------------------

; ---------------------------------BEGIN: EMCC\HansLaserSet.dll\PortSetDlg-----------------------------------------
[PORTDIALOGTEXT]
STATIC_0 = 入力ポートの加工を停止
STATIC_1 = 出力ポートの加工を停止
STATIC_2 = 出力ポート
STATIC_3 = 安全扉
STATIC_4 = 入力ポート
STATIC_5 =レーザーは出力の準備ができています
STATIC_6 = 入力ポート
STATIC_7 = 出力ポート
STATIC_8 = ソフトウェア対応出力
STATIC_9 = 出力ポート
STATIC_10 = レーザー出力
STATIC_11 = ポート
STATIC_12 =外部赤色光表示出力
STATIC_13 = 出力ポート
STATIC_14 = 入力ポート
STATIC_15 = マークされた伴奏
STATIC_16 = 出力ポート
STATIC_17 = マーキング出力の終了
STATIC_18 = 出力ポート
STATIC_19 = パルス幅
STATIC_20 = ファイバーレーザーアラーム出力
STATIC_21 = 出力ポート
STATIC_22 = ポートのマーキングを開始する
STATIC_23 = 入力ポート
IDC_CHECK_LASERWARN = 検出レーザーアラーム
IDC_CHECK_PLUSE_REVERSE = Q信号レベル反転
IDC_RADIO_NORMAL = 標準
IDC_RADIO_BICOLORLAMP = 2 色ライト
IDC_RADIO_TRICOLORLIGHT = トリコロールライト

[error]
1=カードが初期化されていないか、カードが見つかりません！
2=リセット失敗！
3=カードのバージョンが間違っている！
4=アラーム！
6=実行に失敗しました！
7=状態が対応していない！
16=コマンドタイムアウト！
17=コマンドが失われました！
18=インタフェース呼び出し非同期！
19=インタフェースが他のプログラムによって占有されている！
20=Z軸オーバーランまたは補正ファイルが破損している！
21=パラメータ不一致！
23=メモリ割り当てに失敗しました！
100=オフラインで使用中！
101=コマンドが中止されました！
1001=ポート1
1002=ポート2
1003=ポート3
1004=ポート4
1005=ポート5
1006=ポート6
1007=ポート7
1008=レーザー入力の準備ができていない
1009=レーザー入力準備完了

; ---------------------------------END: EMCC\HansLaserSet.dll\PortSetDlg-----------------------------------------

; ---------------------------------BEGIN: EMCC\HansLaserSet. dll\HansLaserSetDlg-----------------------------------------
[TITLESTRING]
IDD_LASERSET_DIALOG=レーザー設定
IDD_PROPPAGE_POWER=電源特性
IDD_PROPPAGE_SYS_SET=ハードウェア設定
IDD_PROPPAGE_TOUCH=ペダル設定
IDD_PORT_SET = ポート設定

[IDD_DIALOG_HANSLASERSET]
CAPTION=システム設定
IDC_BTN_SAVE=保存＃ホゾン＃
IDCANCEL= 終了
LISTTITLE_NAME= 項目名
LISTTITLE_VALUE= 値

; ---------------------------------END: EMCC\HansLaserSet.dll\HansLaserSetDlg-----------------------------------------
